vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32MG12P_DFP.pdsc
        <!-- *************************  Device 'EFR32MG12P132F512GM68'  ***************************** -->
        <device Dname="EFR32MG12P132F512GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P132F512GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P132F512GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00010000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P231">
        <book         name="Documents/efr32mg12-datasheet.pdf"      title="EFR32MG12P231 Data Sheet"/>
        <book         name="Documents/efr32mg12-errata.pdf"         title="EFR32MG12P231 Errata"/>
        <!-- *************************  Device 'EFR32MG12P231F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P231F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P231F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P231F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P231F1024GM68'  ***************************** -->
        <device Dname="EFR32MG12P231F1024GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P231F1024GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P231F1024GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P232">
        <book         name="Documents/efr32mg12-datasheet.pdf"      title="EFR32MG12P232 Data Sheet"/>
        <book         name="Documents/efr32mg12-errata.pdf"         title="EFR32MG12P232 Errata"/>
        <!-- *************************  Device 'EFR32MG12P232F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P232F1024GL125">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F1024GL125"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P232F1024GL125.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P232F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P232F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P232F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P232F1024GM68'  ***************************** -->
        <device Dname="EFR32MG12P232F1024GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F1024GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P232F1024GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00020000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P232F512GM68'  ***************************** -->
        <device Dname="EFR32MG12P232F512GM68">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P232F512GM68"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P232F512GM68.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00080000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00010000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00080000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00080000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32MG12P332">
        <book         name="Documents/efr32mg12-datasheet.pdf"      title="EFR32MG12P332 Data Sheet"/>
        <book         name="Documents/efr32mg12-errata.pdf"         title="EFR32MG12P332 Errata"/>
        <!-- *************************  Device 'EFR32MG12P332F1024GL125'  ***************************** -->
        <device Dname="EFR32MG12P332F1024GL125">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P332F1024GL125"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P332F1024GL125.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32MG12P332F1024GM48'  ***************************** -->
        <device Dname="EFR32MG12P332F1024GM48">
          <compile header="Device/SiliconLabs/EFR32MG12P/Include/em_device.h"  define="EFR32MG12P332F1024GM48"/>
          <debug      svd="SVD/EFR32MG12P/EFR32MG12P332F1024GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00100000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00040000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00100000"  RAMstart="0x20000000" RAMsize="0x40000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00100000"  default="0"  style="IAR"/>
        </device>

